In [1]:
import pandas as pd
import phonenumbers as ph
import probablepeople as pp

# Row duplication

## Company Names

In [31]:
import pprint
company_name_raw = [x.lower() for x in [
                'Fusemachines  INC',
                'FUSEMACHINES      NEPAL, INC.',
                'FUSEMACHINES',
                'fusemachines',
                'fuse org.',
                'fuse organization'
                ]]
pprint.pprint(company_name_raw)

['fusemachines  inc',
 'fusemachines      nepal, inc.',
 'fusemachines',
 'fusemachines',
 'fuse org.',
 'fuse organization']

### Without Library

In [36]:
import re
filter_special_chars = re.compile('[^a-z0-9\s]')
filter_multiple_spaces = re.compile('\s+')
filtered = [filter_multiple_spaces.sub(' ', filter_special_chars.sub(' ', i)) for i in company_name_raw]
filtered

['fusemachines inc',
 'fusemachines nepal inc ',
 'fusemachines',
 'fusemachines',
 'fuse org ',
 'fuse organization']

In [47]:
# Defining stop words
stop_words = [
    "inc",
    "nepal",
    "pvt",
    "organization",
    "org"
]
company_name_clean_reg = [[part for part in i.split() if part not in stop_words][0] for i in filtered]
company_name_clean_reg

['fusemachines',
 'fusemachines',
 'fusemachines',
 'fusemachines',
 'fuse',
 'fuse']

### Using library

In [30]:
company_name_clean = [[i for i,j in pp.parse(x) if j=="CorporationName"][0] for x in company_name_raw]
pprint.pprint(company_name_clean)

['fusemachines', 'fusemachines', 'fusemachines', 'fusemachines', 'fuse', 'fuse']

## Phone Numbers

In [25]:
phone_numbers_raw = [
                 '800/506-3873',\
                 '1-800-506-3873',\
                 '800-506/3873',\
                 '800/506-3873',\
                 '213/665-1661',\
                 '213/665-1661'
                 ]
pprint.pprint(phone_numbers_raw)

['800/506-3873',
 '1-800-506-3873',
 '800-506/3873',
 '800/506-3873',
 '213/665-1661',
 '213/665-1661']

In [62]:
cleaned_phone_number = [ph.format_number(ph.parse(i, "US"), num_format=ph.PhoneNumberFormat.E164) for i in phone_numbers_raw]
cleaned_phone_number

['+18005063873',
 '+18005063873',
 '+18005063873',
 '+18005063873',
 '+12136651661',
 '+12136651661']

In [65]:
df = pd.DataFrame({"Company": company_name_clean_reg, "Phone": cleaned_phone_number}).drop_duplicates()
df

        Company         Phone
0  fusemachines  +18005063873
4          fuse  +12136651661

In [67]:
data = [
    (10.5,"M1",'C3',5,5),
    (8.3,"M2",'A3',6.1,6.1),
    (8,"M1",'C3',2.5,2.5),
    (11.99,"M3",'B3',5.1,5.1),
]
df = pd.DataFrame(data, columns=['f1', 'f2', 'f3','f4','f5'])
df

      f1  f2  f3   f4   f5
0  10.50  M1  C3  5.0  5.0
1   8.30  M2  A3  6.1  6.1
2   8.00  M1  C3  2.5  2.5
3  11.99  M3  B3  5.1  5.1

In [70]:
df.T

       0    1    2      3
f1  10.5  8.3  8.0  11.99
f2    M1   M2   M1     M3
f3    C3   A3   C3     B3
f4   5.0  6.1  2.5    5.1
f5   5.0  6.1  2.5    5.1